In [19]:
from datetime import datetime

datetime_object = datetime.strptime('Jun 1 2005  1:33PM', '%b %d %Y %I:%M%p')
datetime_object

datetime.datetime(2005, 6, 1, 13, 33)

In [33]:
cust=pd.read_csv('cust.csv')
print cust.head()
print cust.info()

   ID        DOB
0   1  20-Aug-12
1   2  27-Feb-14
2   3  10-Mar-16
3   4  20-Aug-12
4   5  27-Feb-14
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
ID     9 non-null int64
DOB    9 non-null object
dtypes: int64(1), object(1)
memory usage: 216.0+ bytes
None

In [34]:
cust['DOB_new']=pd.to_datetime(cust['DOB'], format='%d-%b-%y')

print cust.head()
print cust.info()

   ID        DOB    DOB_new
0   1  20-Aug-12 2012-08-20
1   2  27-Feb-14 2014-02-27
2   3  10-Mar-16 2016-03-10
3   4  20-Aug-12 2012-08-20
4   5  27-Feb-14 2014-02-27
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
ID         9 non-null int64
DOB        9 non-null object
DOB_new    9 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 288.0+ bytes
None

In [35]:
import pypyodbc

In [36]:
pypyodbc.connect?

In [41]:
import pypyodbc 
import pandas as pd
cnxn = pypyodbc.connect("Driver={SQL Server Native Client 11.0};"
                        "Server=localhost;"
                        "Database=alabs;"
                        "Trusted_Connection=yes;")
print cnxn

#cursor = cnxn.cursor()

#cursor.execute('SELECT * FROM customer')

#for row in cursor:
    #print('row = %r' % (row,))

<pypyodbc.Connection instance at 0x0000000009A24A08>

In [42]:
customer = pd.read_sql_query('select * from customer', cnxn)

cnxn.close()

In [43]:
customer.head(10)

  customer_id         dob gender city_code
0      268408  02-01-1970      M         4
1      269696  07-01-1970      F         8
2      268159  08-01-1970      F         8
3      270181  10-01-1970      F         2
4      268073  11-01-1970      M         1
5      273216  15-01-1970      F         5
6      266929  15-01-1970      M         8
7      275152  16-01-1970      M         4
8      275034  18-01-1970      F         4
9      273966  21-01-1970      M         8

In [44]:
df1 = pd.read_csv('./Pandas Case Study/Cust_demo.csv')
df1.head(5)

,ID,Location,Gender,age,Martial_Status,NumberOfDependents,Own_House,No_Years_address
0,4532,"Gandhinagar,Gujarat",0,39,Single,1.0,1,3
1,148736,"Hyderabad,Andhra Pradesh",0,52,Married,0.0,0,3
2,95965,"Shimla,Himachal Pradesh",0,62,Married,0.0,0,2
3,61759,"Srinagar,JK",0,42,Single,1.0,1,1
4,49806,"Imphal,Manipur",0,41,Single,1.0,0,3

In [45]:
import numpy as np
table = pd.pivot_table(df1,index=["Martial_Status","Gender"],columns=["Own_House"],values=["ID","age","NumberOfDependents"],
               aggfunc={"ID":len,"age":[np.sum,np.mean],"NumberOfDependents":[np.sum,np.mean,np.max]},fill_value=0)
table

                             age                                  ID         \
                            mean                 sum             len
Own_House                      0          1        0        1      0      1
Martial_Status Gender
Married        0       52.160914  52.247352   835670   562286  16021  10762
               1       52.447774  52.640732   504128   339638   9612   6452
Single         0       52.348570  52.255563  2104936  1397366  40210  26741
               1       52.336537  52.107011  1268690   830221  24241  15933

                      NumberOfDependents
                                    amax          mean              sum
Own_House                              0   1         0         1      0      1
Martial_Status Gender
Married        0                      20   8  0.769846  0.760378  12025   7968
               1                       8  10  0.768761  0.755102   7181   4736
Single         0                      10  10  0.759954  0.740991  29775  19308
               1                      10  13  0.751187  0.765707  17713  11883

In [46]:
#Advanced queries
table.query('Martial_Status == ["Married"] and Gender == 0')

                             age                                ID         \
                            mean                sum            len
Own_House                      0          1       0       1      0      1
Martial_Status Gender
Married        0       52.160914  52.247352  835670  562286  16021  10762

                      NumberOfDependents
                                    amax         mean              sum
Own_House                              0  1         0         1      0     1
Martial_Status Gender
Married        0                      20  8  0.769846  0.760378  12025  7968